src/cf/Documents/ИзменениеПараметровНачисленияАмортизацииОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИзменениеПараметровНачисленияАмортизацииОС</Name>
			<BasedOn>
				<xr:Item>Catalog.ОсновныеСредства</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ПараметрыАмортизацииОСНалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.СобытияОСОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ЭлементыАмортизацииГрупповыхОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.КомпонентыАмортизацииОС</xr:Item>
				<xr:Item>AccumulationRegister.СрокиИспользованияГрупповыхОбъектовОС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВНалоговомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НакоплениеИнформацииЗаГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользованияБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИспользованияДляВычисленияАмортизацииБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииРаботБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииРаботДляВычисленияАмортизацииБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьДляВычисленияАмортизацииБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентАмортизацииБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентУскоренияБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользованияНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПРДляВычисленияАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛиквидационнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособНачисленияАмортизации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомпонентыАмортизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомпонентАмортизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КомпонентыАмортизацииОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаточнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокСрокаПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииРабот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокОбъемаПродукцииРабот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/СпособыНачисленияАмортизацииОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыНачисленияАмортизацииОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Линейный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиновременноПриПринятииКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшаемогоОстатка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСуммеЧиселЛетИспользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноОбъемуПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕНАОФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕНАОФНа1000кмПробега</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ИзменениеПараметровНачисленияАмортизацииОС/Forms/КомпонентыАмортизации/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Организация,Дата,Ссылка,ОсновноеСредство");
	
	Если ЗначениеЗаполнено(Параметры.АдресХранилищаКомпонентовАмортизации)
		И ЭтоАдресВременногоХранилища(Параметры.АдресХранилищаКомпонентовАмортизации) Тогда
		
		КомпонентыАмортизацииИзПараметров = ПолучитьИзВременногоХранилища(Параметры.АдресХранилищаКомпонентовАмортизации);
		// Нам эти данные больше не нужны - удалим их.
		УдалитьИзВременногоХранилища(Параметры.АдресХранилищаКомпонентовАмортизации);
		
		Если ЗначениеЗаполнено(КомпонентыАмортизацииИзПараметров) Тогда
			КомпонентыАмортизации.Загрузить(КомпонентыАмортизацииИзПараметров);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.ТолькоПросмотр Тогда
		Элементы.КомпонентыАмортизации.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
	КонецЕсли;
	
	СпособНачисленияАмортизации = Параметры.СпособНачисленияАмортизации;
	
	Элементы.КомпонентыАмортизации.ТолькоПросмотр = Параметры.ТолькоПросмотр;
	Элементы.КомпонентыАмортизации.ИзменятьСоставСтрок = НЕ Параметры.ТолькоПросмотр;
	Элементы.КомпонентыАмортизации.ИзменятьПорядокСтрок = НЕ Параметры.ТолькоПросмотр;
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	РеквизитыТабличнойЧастиЦенностиОтВыбытия = Метаданные.Документы.ИзменениеПараметровНачисленияАмортизацииОС.ТабличныеЧасти.КомпонентыАмортизации.Реквизиты;
	
	ЭлементыИМетаданные = Новый Структура;
	ЭлементыИМетаданные.Вставить("КомпонентАмортизации", РеквизитыТабличнойЧастиЦенностиОтВыбытия.КомпонентАмортизации);
	ЭлементыИМетаданные.Вставить("Стоимость", РеквизитыТабличнойЧастиЦенностиОтВыбытия.Стоимость);
	Если СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.Линейный Тогда
		ЭлементыИМетаданные.Вставить("СрокПолезногоИспользования", РеквизитыТабличнойЧастиЦенностиОтВыбытия.СрокПолезногоИспользования);
	ИначеЕсли СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции Тогда
		ЭлементыИМетаданные.Вставить("ОбъемПродукцииРабот", РеквизитыТабличнойЧастиЦенностиОтВыбытия.ОбъемПродукцииРабот);
	КонецЕсли;
	
	ПроверяемыйСписок = РедактированиеВПодчиненныхФормах.НовыйПроверяемыйСписок();
	ПроверяемыйСписок.Таблица = КомпонентыАмортизации;
	ПроверяемыйСписок.Имя = "КомпонентыАмортизации";
	ПроверяемыйСписок.Синоним = СинонимТабличнойЧасти();
	
	РедактированиеВПодчиненныхФормах.ВыполнитьПроверкуЗаполненияТаблицыПоРеквизитамМетаданных(
		ПроверяемыйСписок, ЭлементыИМетаданные, Отказ);
	
	ПроверитьОтсутствиеДублей(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы И Модифицированность Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемФормыЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
	КонецЕсли;
	
	Если Не Отказ И Модифицированность Тогда
		Отказ = Не ПроверитьЗаполнение();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыКомпонентыАмортизации

&НаКлиенте
Процедура КомпонентыАмортизацииСтоимостьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.КомпонентыАмортизации.ТекущиеДанные;
	
	Если ТекущиеДанные.ОстаточнаяСтоимость = 0 Тогда
		ТекущиеДанные.ОстаточнаяСтоимость = ТекущиеДанные.Стоимость;
	КонецЕсли;
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпонентыАмортизацииСрокПолезногоИспользованияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.КомпонентыАмортизации.ТекущиеДанные;
	
	Если ТекущиеДанные.ОстатокСрокаПолезногоИспользования = 0 Тогда
		ТекущиеДанные.ОстатокСрокаПолезногоИспользования = ТекущиеДанные.СрокПолезногоИспользования;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпонентыАмортизацииОбъемПродукцииРаботПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.КомпонентыАмортизации.ТекущиеДанные;
	
	Если ТекущиеДанные.ОстатокОбъемаПродукцииРабот = 0 Тогда
		ТекущиеДанные.ОстатокОбъемаПродукцииРабот = ТекущиеДанные.ОбъемПродукцииРабот;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЗакрытьФормуИВернутьРезультат(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	ЗакрытьФормуИВернутьРезультат(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	Если КомпонентыАмортизации.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения(
			"ВопросПередЗаполнениемТабличнойЧастиЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Иначе
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	СпособНачисленияАмортизацииПропорциональноОбъемуПродукции = СпособНачисленияАмортизации =
		Перечисления.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции;
	
	Элементы.КомпонентыАмортизацииСрокПолезногоИспользования.Видимость = НЕ СпособНачисленияАмортизацииПропорциональноОбъемуПродукции;
	Элементы.КомпонентыАмортизацииОстатокСрокаПолезногоИспользования.Видимость = НЕ СпособНачисленияАмортизацииПропорциональноОбъемуПродукции;
	Элементы.КомпонентыАмортизацииОбъемПродукцииРабот.Видимость = СпособНачисленияАмортизацииПропорциональноОбъемуПродукции;
	Элементы.КомпонентыАмортизацииОстатокОбъемаПродукцииРабот.Видимость = СпособНачисленияАмортизацииПропорциональноОбъемуПродукции;
	
	Заголовок = СтрШаблон(НСтр("ru = '%1: %2'"), СинонимТабличнойЧасти(), ОсновноеСредство);
	
	УстановитьОграниченияЭлементовФормыИзМетаданных();
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция СинонимТабличнойЧасти()
	
	Возврат НСтр("ru = 'Компоненты амортизации'");
	
КонецФункции

&НаСервере
Процедура УстановитьОграниченияЭлементовФормыИзМетаданных()
	
	ЭлементыИМетаданные = Новый Соответствие;
	
	ЭлементыИМетаданные.Вставить(Элементы.КомпонентыАмортизацииКомпонентАмортизации,
		Метаданные.Документы.ИзменениеПараметровНачисленияАмортизацииОС.ТабличныеЧасти.КомпонентыАмортизации.Реквизиты.КомпонентАмортизации);
	
	ЭлементыИМетаданные.Вставить(Элементы.КомпонентыАмортизацииСтоимость,
		Метаданные.Документы.ИзменениеПараметровНачисленияАмортизацииОС.ТабличныеЧасти.КомпонентыАмортизации.Реквизиты.Стоимость);
	
	Если СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.Линейный Тогда
		ЭлементыИМетаданные.Вставить(Элементы.КомпонентыАмортизацииСрокПолезногоИспользования,
			Метаданные.Документы.ИзменениеПараметровНачисленияАмортизацииОС.ТабличныеЧасти.КомпонентыАмортизации.Реквизиты.СрокПолезногоИспользования);
	ИначеЕсли СпособНачисленияАмортизации = Перечисления.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции Тогда
		ЭлементыИМетаданные.Вставить(Элементы.КомпонентыАмортизацииОбъемПродукцииРабот,
			Метаданные.Документы.ИзменениеПараметровНачисленияАмортизацииОС.ТабличныеЧасти.КомпонентыАмортизации.Реквизиты.ОбъемПродукцииРабот);
	КонецЕсли;
	
	РедактированиеВПодчиненныхФормах.УстановитьСвойстваЭлементовПоРеквизитамМетаданных(ЭлементыИМетаданные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьФормуИВернутьРезультат(Истина);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ЗакрытьФормуИВернутьРезультат(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуИВернутьРезультат(ПередатьВладельцуРезультат)
	
	РезультатЗаполнения = Неопределено;
	
	Если ПередатьВладельцуРезультат Тогда
		Если Не ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
		
		РезультатЗаполнения = Новый Структура;
		РезультатЗаполнения.Вставить("Модифицированность", Модифицированность);
		РезультатЗаполнения.Вставить("КомпонентыАмортизации", КомпонентыАмортизации);
	КонецЕсли;
	
	Модифицированность = Ложь;
	Закрыть(РезультатЗаполнения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтоги(Форма)
	
	Форма.ИтогиВсего = Форма.КомпонентыАмортизации.Итог("Стоимость");
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗаполнениемТабличнойЧастиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Период = Новый МоментВремени(Дата, Ссылка);
	
	ДанныеКомпонентов = Документы.ИзменениеПараметровНачисленияАмортизацииОС.ПредыдущиеЗначенияЭлементовКомпонентыАмортизации(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОсновноеСредство),
		Период,
		Организация);
	
	КомпонентыАмортизации.Очистить();
	Для Каждого ДанныеКомпонента Из ДанныеКомпонентов Цикл
		ЗаполнитьЗначенияСвойств(КомпонентыАмортизации.Добавить(), ДанныеКомпонента);
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьОтсутствиеДублей(Отказ)
	
	ТаблицаКомпонентов = КомпонентыАмортизации.Выгрузить(, "КомпонентАмортизации");
	ТаблицаКомпонентов.Колонки.Добавить("__КоличествоВхождений", ОбщегоНазначения.ОписаниеТипаЧисло(32));
	ТаблицаКомпонентов.ЗаполнитьЗначения(1, "__КоличествоВхождений");
	ТаблицаКомпонентов.Свернуть("КомпонентАмортизации", "__КоличествоВхождений");
	
	НайденыДубли = Ложь;
	
	Для каждого Строка Из ТаблицаКомпонентов Цикл
		Если Строка.__КоличествоВхождений > 1 Тогда
			НайденыДубли = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НайденыДубли Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("СПИСОК", "КОРРЕКТНОСТЬ", , ,
			СинонимТабличнойЧасти(), НСтр("ru = 'Значения в колонке ""Компонент"" не должны повторяться.'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
